Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>__СрокЛицензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПИНФЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ориентир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Каналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Зоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Зоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хозяйственный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтоГруппа) Тогда
		Зоны.Свернуть("Зона");
		
		Для Каждого Строка Из Зоны Цикл
			Если глСсылкаСуществует(Строка.Зона) = Ложь Тогда
				Зоны.Удалить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Если (НЕ ПометкаУдаления) Тогда
			// Контроль уникальности ИНН
			Если Константы.Контрагенты_КонтрольУникальностиИНН.Получить() Тогда
				Если (НЕ ПустаяСтрока(ИНН)) Тогда
					КонтрагентПоИНН = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
					Если (Не КонтрагентПоИНН.Пустая()) и КонтрагентПоИНН.Ссылка <> Ссылка Тогда
						Сообщить("ИНН не уникален: " + ИНН);
						
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Контроль уникальности ПИНФЛ
			Если Константы.Контрагенты_КонтрольУникальностиПИНФЛ.Получить() Тогда
				Если (НЕ ПустаяСтрока(ПИНФЛ)) Тогда
					КонтрагентПоПИНФЛ = Справочники.Контрагенты.НайтиПоРеквизиту("ПИНФЛ", ПИНФЛ);
					Если (Не КонтрагентПоПИНФЛ.Пустая()) и КонтрагентПоПИНФЛ.Ссылка <> Ссылка Тогда
						Сообщить("ПИНФЛ не уникален: " + ПИНФЛ);
						
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ПустаяСтрока(ПолноеНаименование) Тогда
				ПолноеНаименование = СокрЛП(Наименование);
			КонецЕсли;
		КонецЕсли;
		
		Если Константы.Контрагенты_ТранслитерацияНаименованияПриЗаписи.Получить() Тогда
			Наименование = СтроковыеФункции.Транслитерация(Наименование);
		КонецЕсли;
		
		Если Константы.Контрагенты_ТрансформироватьНаименованияВВерхнийРегистр.Получить() Тогда
			Наименование = ВРег(СокрЛП(Наименование));
			ПолноеНаименование = ВРег(СокрЛП(ПолноеНаименование));
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(ИНН)) = 14 Тогда
			ПИНФЛ = СокрЛП(ИНН);
			ИНН = "";
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(ПИНФЛ)) = 9 Тогда
			ИНН = СокрЛП(ПИНФЛ);
			ПИНФЛ = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИНН) Тогда
			ТипКонтрагента = Перечисления.ТипыКонтрагента.ЮридическоеЛицо;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПИНФЛ) Тогда
			ТипКонтрагента = Перечисления.ТипыКонтрагента.ФизическоеЛицо;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИНН) = Ложь И ЗначениеЗаполнено(ПИНФЛ) = Ложь Тогда
			ТипКонтрагента = Перечисления.ТипыКонтрагента.Хозяйственный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если ЭтоГруппа = Ложь Тогда
		ИНН = "";
		ПИНФЛ = "";
		ПолноеНаименование = "";
		Телефон = "";
		КонтактноеЛицо = "";
		Адрес = "";
		Руководитель = "";
		Бухгалтер = "";
		КодПНДС = "";
		ДополнительныйКод = "";
	КонецЕсли;
КонецПроцедуры
